In [3]:
import pandas as pd
import numpy as np

In [6]:
pd.DataFrame(np.array([1,2,3,4,5]), index=list('abcde'))

   0
a  1
b  2
c  3
d  4
e  5

In [7]:
pd.DataFrame(np.array([1,2,3,4,5]), index=list('abcde'), columns=list('h'))

   h
a  1
b  2
c  3
d  4
e  5

In [8]:
d = {'first': [1,2,3,4,5], 'second': [8,9,10,11,12]}

In [9]:
pd.DataFrame(d)

   first  second
0      1       8
1      2       9
2      3      10
3      4      11
4      5      12

In [10]:
pd.DataFrame(d, index=['a', 'b', 'c', 'd', 'e'])

   first  second
a      1       8
b      2       9
c      3      10
d      4      11
e      5      12

In [11]:
df = pd.read_csv('titanic_test.csv')

In [13]:
df = pd.read_csv('titanic_test.csv', usecols=['Name', 'Sex'])

In [14]:
df

                                                  Name     Sex
0                              Braund, Mr. Owen Harris    male
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female
2                               Heikkinen, Miss. Laina  female
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female
4                             Allen, Mr. William Henry    male
..                                                 ...     ...
886                              Montvila, Rev. Juozas    male
887                       Graham, Miss. Margaret Edith  female
888           Johnston, Miss. Catherine Helen "Carrie"  female
889                              Behr, Mr. Karl Howell    male
890                                Dooley, Mr. Patrick    male

[891 rows x 2 columns]

In [15]:
df = pd.read_json('https://jsonplaceholder.typicode.com/todos/')

In [17]:
df.to_csv('hello.csv')

In [18]:
df

     userId   id                                              title  completed
0         1    1                                 delectus aut autem      False
1         1    2                 quis ut nam facilis et officia qui      False
2         1    3                                fugiat veniam minus      False
3         1    4                                   et porro tempora       True
4         1    5  laboriosam mollitia et enim quasi adipisci qui...      False
..      ...  ...                                                ...        ...
195      10  196                consequuntur aut ut fugit similique       True
196      10  197                  dignissimos quo nobis earum saepe       True
197      10  198                       quis eius est sint explicabo       True
198      10  199                       numquam repellendus a magnam       True
199      10  200                       ipsam aperiam voluptates qui      False

[200 rows x 4 columns]

In [19]:
df.ndim

2

In [20]:
df.shape

(200, 4)

In [21]:
df.size

800

In [22]:
df.dtypes

userId        int64
id            int64
title        object
completed      bool
dtype: object

In [25]:
df.columns

Index(['userId', 'id', 'title', 'completed'], dtype='object')

In [26]:
len(df.columns)

4

In [27]:
df.index

RangeIndex(start=0, stop=200, step=1)

In [28]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 200 entries, 0 to 199
Data columns (total 4 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   userId     200 non-null    int64
 1   id         200 non-null    int64
 2   title      200 non-null    object
 3   completed  200 non-null    bool
dtypes: bool(1), int64(2), object(1)
memory usage: 5.0+ KB

In [29]:
df.describe()

           userId          id
count  200.000000  200.000000
mean     5.500000  100.500000
std      2.879489   57.879185
min      1.000000    1.000000
25%      3.000000   50.750000
50%      5.500000  100.500000
75%      8.000000  150.250000
max     10.000000  200.000000

# columns selection

In [30]:
df.userId

0       1
1       1
2       1
3       1
4       1
       ..
195    10
196    10
197    10
198    10
199    10
Name: userId, Length: 200, dtype: int64

In [32]:
df['userId']

0       1
1       1
2       1
3       1
4       1
       ..
195    10
196    10
197    10
198    10
199    10
Name: userId, Length: 200, dtype: int64

# Select Multiple Columns

In [34]:
df[['userId', 'id']]

     userId   id
0         1    1
1         1    2
2         1    3
3         1    4
4         1    5
..      ...  ...
195      10  196
196      10  197
197      10  198
198      10  199
199      10  200

[200 rows x 2 columns]

# select one column in 2D

In [35]:
df[['userId']]

     userId
0         1
1         1
2         1
3         1
4         1
..      ...
195      10
196      10
197      10
198      10
199      10

[200 rows x 1 columns]

# Change Column values

In [36]:
df.userId = 100

In [41]:
df['Hello'] = 25

In [43]:
df['Hello'] = 'umesh'

In [47]:
df.insert(2, 'testid', 101)

In [48]:
df[['userId', 'testid']]

,userId,id,testid,title,completed,Hello
0,100,1,101,delectus aut autem,False,umesh
1,100,2,101,quis ut nam facilis et officia qui,False,umesh
2,100,3,101,fugiat veniam minus,False,umesh
3,100,4,101,et porro tempora,True,umesh
4,100,5,101,laboriosam mollitia et enim quasi adipisci qui...,False,umesh
...,...,...,...,...,...,...
195,100,196,101,consequuntur aut ut fugit similique,True,umesh
196,100,197,101,dignissimos quo nobis earum saepe,True,umesh
197,100,198,101,quis eius est sint explicabo,True,umesh
198,100,199,101,numquam repellendus a magnam,True,umesh
199,100,200,101,ipsam aperiam voluptates qui,False,umesh

In [49]:
d = {'col1': [1, 2], 'col2': [3, 4]}

In [50]:
d

{'col1': [1, 2], 'col2': [3, 4]}

In [51]:
df = pd.DataFrame(d)

In [52]:
df

   col1  col2
0     1     3
1     2     4

In [55]:
df[['col1', 'col2']]

   col1  col2
0     1     3
1     2     4

In [56]:
df.col1 = [100, 200]

In [57]:
df

   col1  col2
0   100     3
1   200     4

In [58]:
df.col1 + 105

0    205
1    305
Name: col1, dtype: int64

In [59]:
df.col1 = df.col1 + 100

In [60]:
df

   col1  col2
0   200     3
1   300     4

In [61]:
df = pd.read_csv('Bengaluru_House_Data.csv')

In [63]:
df.price.mean() # df['price']

0         39.07
1        120.00
2         62.00
3         95.00
4         51.00
          ...
13315    231.00
13316    400.00
13317     60.00
13318    488.00
13319     17.00
Name: price, Length: 13320, dtype: float64

In [64]:
df.price.mean()

112.56562650150138

In [65]:
df.price.median()

72.0

In [66]:
df

,area_type,availability,location,size,society,total_sqft,bath,balcony,price
0,Super built-up Area,19-Dec,Electronic City Phase II,2 BHK,Coomee,1056,2.0,1.0,39.07
1,Plot Area,Ready To Move,Chikka Tirupathi,4 Bedroom,Theanmp,2600,5.0,3.0,120.00
2,Built-up Area,Ready To Move,Uttarahalli,3 BHK,NaN,1440,2.0,3.0,62.00
3,Super built-up Area,Ready To Move,Lingadheeranahalli,3 BHK,Soiewre,1521,3.0,1.0,95.00
4,Super built-up Area,Ready To Move,Kothanur,2 BHK,NaN,1200,2.0,1.0,51.00
...,...,...,...,...,...,...,...,...,...
13315,Built-up Area,Ready To Move,Whitefield,5 Bedroom,ArsiaEx,3453,4.0,0.0,231.00
13316,Super built-up Area,Ready To Move,Richards Town,4 BHK,NaN,3600,5.0,NaN,400.00
13317,Built-up Area,Ready To Move,Raja Rajeshwari Nagar,2 BHK,Mahla T,1141,2.0,1.0,60.00
13318,Super built-up Area,18-Jun,Padmanabhanagar,4 BHK,SollyCl,4689,4.0,1.0,488.00
13319,Super built-up Area,Ready To Move,Doddathoguru,1 BHK,NaN,550,1.0,1.0,17.00